In [2]:
import pandas as pd
import numpy as np 
from pandas import DataFrame, Series

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [5]:
df['FlightNumber']= df['FlightNumber'].interpolate().astype(int)

In [6]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [9]:
temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From', 'To']

In [10]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [11]:
df.From_To.str.capitalize()

0        London_paris
1        Madrid_milan
2    London_stockholm
3      Budapest_paris
4     Brussels_london
Name: From_To, dtype: object

In [12]:
df.From_To.str.title()

0        London_Paris
1        Madrid_Milan
2    London_Stockholm
3      Budapest_Paris
4     Brussels_London
Name: From_To, dtype: object

In [14]:
del df['From_To']

In [15]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)

In [16]:
df

               Airline  FlightNumber  delay_1  delay_2  delay_3
0               KLM(!)         10045     23.0     47.0      NaN
1    <Air France> (12)         10055      NaN      NaN      NaN
2  (British Airways. )         10065     24.0     43.0     87.0
3       12. Air France         10075     13.0      NaN      NaN
4          "Swiss Air"         10085     67.0     32.0      NaN